In [1]:
from datetime import datetime

In [2]:
my_year = 2023
my_month = 12
my_day = 20
my_hour = 20
my_min = 21
my_sec= 40

In [3]:
my_date = datetime(my_year,my_month,my_day)

In [4]:
my_date

datetime.datetime(2023, 12, 20, 0, 0)

In [5]:
my_date.day

20

## Pandas

In [6]:
import pandas as pd

In [7]:
ser1 = pd.Series(['Dec 20, 2023','2023-12-21',None])
ser1

0    Dec 20, 2023
1      2023-12-21
2            None
dtype: object

In [8]:
ser1[0]

'Dec 20, 2023'

In [9]:
pd.to_datetime(ser1, format='mixed')

0   2023-12-20
1   2023-12-21
2          NaT
dtype: datetime64[ns]

In [10]:
dt1 = '10-12-2023'


#is it 10th of dec or 12th of Oct?

In [11]:
pd.to_datetime(dt1, dayfirst=True)

Timestamp('2023-12-10 00:00:00')

## Custom Time String Formatting

In [12]:
dt2 = '20-----Dec&&&2023'

In [13]:
pd.to_datetime(dt2, format='%d-----%b&&&%Y')

Timestamp('2023-12-20 00:00:00')

# Example

In [15]:
df = pd.read_csv(r"C:\Users\shrey\Desktop\DAPP_Aug2023\DATA1\RetailSales_BeerWineLiquor.csv")

In [16]:
df

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [18]:
df['DATE'] = pd.to_datetime(df['DATE'])

In [21]:
type(df.iloc[0]['DATE'])

pandas._libs.tslibs.timestamps.Timestamp

## Parse Dates Automatically (doesn't always work)

In [22]:
df1 = pd.read_csv(r"C:\Users\shrey\Desktop\DAPP_Aug2023\DATA1\RetailSales_BeerWineLiquor.csv", parse_dates=[0])

In [23]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

## Resample

In [24]:
df1.index

RangeIndex(start=0, stop=340, step=1)

In [25]:
df1 = df1.set_index('DATE')

In [26]:
df1

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [31]:
df1.resample(rule='A').sum()

#A means yearly frequency

            MRTSSM4453USN
DATE
1992-12-31          21687
1993-12-31          21538
1994-12-31          22101
1995-12-31          22007
1996-12-31          23157
1997-12-31          24081
1998-12-31          25382
1999-12-31          26476
2000-12-31          28507
2001-12-31          29621
2002-12-31          29894
2003-12-31          30469
2004-12-31          32189
2005-12-31          33567
2006-12-31          36016
2007-12-31          38128
2008-12-31          39504
2009-12-31          40245
2010-12-31          41401
2011-12-31          42392
2012-12-31          44365
2013-12-31          46076
2014-12-31          48286
2015-12-31          50550
2016-12-31          53213
2017-12-31          55232
2018-12-31          57968
2019-12-31          59673
2020-12-31          19690

In [32]:
df1 = df1.reset_index()

In [37]:
df1.tail()

          DATE  MRTSSM4453USN
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

In [35]:
import datetime as dt

In [36]:
df1['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int32

In [38]:
df1['DATE'].dt.is_leap_year

0       True
1       True
2       True
3       True
4       True
       ...
335    False
336     True
337     True
338     True
339     True
Name: DATE, Length: 340, dtype: bool